pengshulin/mcush/MindMotion/mm32f0/startup/inc/mm32.h
#if defined(__MM0P1) || defined(__MM0Q1)
////////////////////////////////////////////////////////////////////////////////
/// @brief ADC_SREXT Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
    #define  ADC_SREXT_VALID_Pos        (0)
    #define  ADC_SREXT_VALID            (0x0FU << ADC_SREXT_VALID_Pos)          ///< VALID[3:0] ADC channel 12, 14, 15 valid flag
    #define  ADC_SREXT_OVERRUN_Pos      (4)
    #define  ADC_SREXT_OVERRUN          (0x0FU << ADC_SREXT_OVERRUN_Pos)        ///< OVERRUN[7:4] ADC channel 12, 14, 15 data covered flag
#endif


#if defined(__MM3N1) || defined(__MM0N1)
////////////////////////////////////////////////////////////////////////////////
/// @brief AES_CR Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
    #define AES_CR_EN_Pos               (0)
    #define AES_CR_EN                   (0x01U << AES_CR_EN_Pos)                ///< AES Enable
    #define AES_CR_DATATYPE_Pos         (1)
    #define AES_CR_DATATYPE             (0x03U << AES_CR_DATATYPE_Pos)          ///< Data type selection
    #define AES_CR_UNREVERSE            (0x00U << AES_CR_DATATYPE_Pos)          ///< Unreverse
    #define AES_CR_HALFREVERSE          (0x01U << AES_CR_DATATYPE_Pos)          ///< Half reverse
    #define AES_CR_BYTEREVERSE          (0x02U << AES_CR_DATATYPE_Pos)          ///< Byte reverse
    #define AES_CR_BITREVERSE           (0x03U << AES_CR_DATATYPE_Pos)          ///< Bit reverse
    #define AES_CR_MODE_Pos             (3)
    #define AES_CR_MODE                 (0x03U << AES_CR_MODE_Pos)              ///< AES Mode Of Operation
    #define AES_CR_ENCRYPT              (0x00U << AES_CR_MODE_Pos)              ///< Encrypt mode
    #define AES_CR_KEYEXT               (0x01U << AES_CR_MODE_Pos)              ///< Key Extend mode
    #define AES_CR_DECRYPT              (0x02U << AES_CR_MODE_Pos)              ///< Decrypt mode
    #define AES_CR_EXTDECRYPT           (0x03U << AES_CR_MODE_Pos)              ///< Key extend and decrypt mode
    #define AES_CR_CHMODL_Pos           (5)
    #define AES_CR_CHMODH_Pos           (16)
    #define AES_CR_CHMODL               (0x03U << AES_CR_CHMODL_Pos)            ///< AES chaining mode low bits
    #define AES_CR_CHMODH               (0x01U << AES_CR_CHMODH_Pos)            ///< AES chaining mode high bits
    #define AES_CR_EBC                  (0x00U << AES_CR_CHMODL_Pos | 0x00U << AES_CR_CHMODH_Pos)   ///< ECB chaining mode
    #define AES_CR_CBC                  (0x01U << AES_CR_CHMODL_Pos | 0x00U << AES_CR_CHMODH_Pos)   ///< CBC chaining mode
    #define AES_CR_CTR                  (0x02U << AES_CR_CHMODL_Pos | 0x00U << AES_CR_CHMODH_Pos)   ///< CTR chaining mode
    #define AES_CR_CFB                  (0x00U << AES_CR_CHMODL_Pos | 0x01U << AES_CR_CHMODH_Pos)   ///< CFB chaining mode
    #define AES_CR_OFB                  (0x01U << AES_CR_CHMODL_Pos | 0x01U << AES_CR_CHMODH_Pos)   ///< OFB chaining mode
    #define AES_CR_CCFC_Pos             (7)
    #define AES_CR_CCFC                 (0x01U << AES_CR_CCFC_Pos)              ///< Computation Complete Flag Clear
    #define AES_CR_ERRC_Pos             (8)
    #define AES_CR_ERRC                 (0x01U << AES_CR_ERRC_Pos)              ///< Error Clear
    #define AES_CR_CCIE_Pos             (9)
    #define AES_CR_CCIE                 (0x01U << AES_CR_CCIE_Pos)              ///< Computation Complete Interrupt Enable
    #define AES_CR_ERRIE_Pos            (10)
    #define AES_CR_ERRIE                (0x01U << AES_CR_ERRIE_Pos)             ///< Error Interrupt Enable
    #define AES_CR_DMAINEN_Pos          (11)
    #define AES_CR_DMAINEN              (0x01U << AES_CR_DMAINEN_Pos)           ///< DMA ENable managing the data input phase
    #define AES_CR_DMAOUTEN_Pos         (12)
    #define AES_CR_DMAOUTEN             (0x01U << AES_CR_DMAOUTEN_Pos)          ///< DMA Enable managing the data output phase
    #define AES_CR_KSIZE_Pos            (18)
    #define AES_CR_KSIZE                (0x03U << AES_CR_KSIZE_Pos)             ///< Key size
    #define AES_CR_KSIZE128             (0x00U << AES_CR_KSIZE_Pos)             ///< Key size 128bit
    #define AES_CR_KSIZE192             (0x01U << AES_CR_KSIZE_Pos)             ///< Key size 192bit
    #define AES_CR_KSIZE256             (0x02U << AES_CR_KSIZE_Pos)             ///< Key size 256bit
    #define AES_CR_FBSEL_Pos            (20)
    #define AES_CR_FBSEL                (0x03U << AES_CR_FBSEL_Pos)             ///< Feedback selection
    #define AES_CR_FB1                  (0x00U << AES_CR_FBSEL_Pos)             ///< Feedback 1bit
    #define AES_CR_FB8                  (0x01U << AES_CR_FBSEL_Pos)             ///< Feedback 8bit
    #define AES_CR_FB64                 (0x02U << AES_CR_FBSEL_Pos)             ///< Feedback 64bit
    #define AES_CR_FB128                (0x03U << AES_CR_FBSEL_Pos)             ///< Feedback 128bit

////////////////////////////////////////////////////////////////////////////////
/// @brief AES_SR Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
    #define AES_SR_CCF_Pos              (0)
    #define AES_SR_CCF                  (0x01U << AES_SR_CCF_Pos)               ///< Computation Complete Flag
    #define AES_SR_RDERR_Pos            (1)
    #define AES_SR_RDERR                (0x01U << AES_SR_RDERR_Pos)             ///< Read Error Flag
    #define AES_SR_WRERR_Pos            (2)
    #define AES_SR_WRERR                (0x01U << AES_SR_WRERR_Pos)             ///< Write Error Flag

////////////////////////////////////////////////////////////////////////////////
/// @brief AES_DINR Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
    #define AES_DINR_Pos                (0)
    #define AES_DINR                    (0xFFFFFFFFU << AES_DINR_Pos)           ///< AES Data Input Register

////////////////////////////////////////////////////////////////////////////////
/// @brief AES_DOUTR Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
    #define AES_DOUTR_Pos               (0)
    #define AES_DOUTR                   (0xFFFFFFFFU << AES_DOUTR_Pos)          ///< AES Data Output Register

////////////////////////////////////////////////////////////////////////////////
/// @brief AES_KEYRn Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
    #define AES_KEYRn_Pos               (0)
    #define AES_KEYRn                   (0xFFFFFFFFU << AES_KEYRn_Pos)          ///< AES Key Register n

////////////////////////////////////////////////////////////////////////////////
/// @brief AES_IVRn Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
    #define AES_IVRn_Pos                (0)
    #define AES_IVRn                    (0xFFFFFFFFU << AES_IVRn_Pos)           ///< AES Initialization Vector Register n
#endif

////////////////////////////////////////////////////////////////////////////////
/// @brief BKP_DRn Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define BKP_DR_DATA_Pos                 (0)
#define BKP_DR_DATA                     (0xFFFFU << BKP_DR_DATA)                ///< Backup data

#if defined(__MM3N1)
////////////////////////////////////////////////////////////////////////////////
/// @brief BKP_RTCCR Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
    #define BKP_RTCCR_CAL_Pos           (0)
    #define BKP_RTCCR_CAL               (0x7FU << BKP_RTCCR_CAL_Pos)            ///< Calibration value
    #define BKP_RTCCR_CCO_Pos           (7)
    #define BKP_RTCCR_CCO               (0x01U << BKP_RTCCR_CCO_Pos)            ///< Calibration Clock Output
    #define BKP_RTCCR_ASOE_Pos          (8)
    #define BKP_RTCCR_ASOE              (0x01U << BKP_RTCCR_ASOE_Pos)           ///< Alarm or Second Output Enable
    #define BKP_RTCCR_ASOS_Pos          (9)
    #define BKP_RTCCR_ASOS              (0x01U << BKP_RTCCR_ASOS_Pos)           ///< Alarm or Second Output Selection

////////////////////////////////////////////////////////////////////////////////
/// @brief BKP_CR Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
    #define BKP_CR_TPE_Pos              (0)
    #define BKP_CR_TPE                  (0x01U << BKP_CR_TPE_Pos)               ///< TAMPER pin enable
    #define BKP_CR_TPAL_Pos             (1)
    #define BKP_CR_TPAL                 (0x01U << BKP_CR_TPAL_Pos)              ///< TAMPER pin active level

////////////////////////////////////////////////////////////////////////////////
/// @brief BKP_CSR Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
    #define BKP_CSR_CTE_Pos             (0)
    #define BKP_CSR_CTE                 (0x01U << BKP_CSR_CTE_Pos)              ///< Clear Tamper event
    #define BKP_CSR_CTI_Pos             (1)
    #define BKP_CSR_CTI                 (0x01U << BKP_CSR_CTI_Pos)              ///< Clear Tamper Interrupt
    #define BKP_CSR_TPIE_Pos            (2)
    #define BKP_CSR_TPIE                (0x01U << BKP_CSR_TPIE_Pos)             ///< TAMPER Pin interrupt enable
    #define BKP_CSR_TEF_Pos             (8)
    #define BKP_CSR_TEF                 (0x01U << BKP_CSR_TEF_Pos)              ///< Tamper Event Flag
    #define BKP_CSR_TIF_Pos             (9)
    #define BKP_CSR_TIF                 (0x01U << BKP_CSR_TIF_Pos)              ///< Tamper Interrupt Flag
#endif

#if defined(__MM3N1) || defined(__MM0N1) || defined(__MM3O1)
////////////////////////////////////////////////////////////////////////////////
/// @brief CAN basic
////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////
/// @brief CAN_CR register Bit definition
////////////////////////////////////////////////////////////////////////////////
    #define CAN_CR_RR_Pos               (0)
    #define CAN_CR_RR                   (0x01U << CAN_CR_RR_Pos)                ///< CAN reset request
    #define CAN_CR_RIE_Pos              (1)
    #define CAN_CR_RIE                  (0x01U << CAN_CR_RIE_Pos)               ///< CAN receive interrupt enable
    #define CAN_CR_TIE_Pos              (2)
    #define CAN_CR_TIE                  (0x01U << CAN_CR_TIE_Pos)               ///< CAN transmit interrupt enable
    #define CAN_CR_EIE_Pos              (3)
    #define CAN_CR_EIE                  (0x01U << CAN_CR_EIE_Pos)               ///< CAN error interrupt enable
    #define CAN_CR_OIE_Pos              (4)
    #define CAN_CR_OIE                  (0x01U << CAN_CR_OIE_Pos)               ///< CAN overflow interrupt enable

////////////////////////////////////////////////////////////////////////////////
/// @brief CAN_CMR register Bit definition
////////////////////////////////////////////////////////////////////////////////
    #define CAN_CMR_TR_Pos              (0)
    #define CAN_CMR_TR                  (0x01U << CAN_CMR_TR_Pos )              ///< CAN transmission request
    #define CAN_CMR_AT_Pos              (1)
    #define CAN_CMR_AT                  (0x01U << CAN_CMR_AT_Pos )              ///< CAN abort transmission
    #define CAN_CMR_RRB_Pos             (2)
    #define CAN_CMR_RRB                 (0x01U << CAN_CMR_RRB_Pos)              ///< CAN release receive buffer
    #define CAN_CMR_CDO_Pos             (3)
    #define CAN_CMR_CDO                 (0x01U << CAN_CMR_CDO_Pos)              ///< CAN clear data overrun

////////////////////////////////////////////////////////////////////////////////
/// @brief CAN_SR register Bit definition
////////////////////////////////////////////////////////////////////////////////
    #define CAN_SR_RBS_Pos              (0)
    #define CAN_SR_RBS                  (0x01U << CAN_SR_RBS_Pos)               ///< CAN receive buffer status
    #define CAN_SR_DOS_Pos              (1)
    #define CAN_SR_DOS                  (0x01U << CAN_SR_DOS_Pos)               ///< CAN data overrun status
    #define CAN_SR_TBS_Pos              (2)
    #define CAN_SR_TBS                  (0x01U << CAN_SR_TBS_Pos)               ///< CAN transmit buffer status
    #define CAN_SR_TCS_Pos              (3)
    #define CAN_SR_TCS                  (0x01U << CAN_SR_TCS_Pos)               ///< CAN transmission complete status
    #define CAN_SR_RS_Pos               (4)
    #define CAN_SR_RS                   (0x01U << CAN_SR_RS_Pos)                ///< CAN receive status
    #define CAN_SR_TS_Pos               (5)
    #define CAN_SR_TS                   (0x01U << CAN_SR_TS_Pos)                ///< CAN transmit status
    #define CAN_SR_ES_Pos               (6)
    #define CAN_SR_ES                   (0x01U << CAN_SR_ES_Pos)                ///< CAN error status
    #define CAN_SR_BS_Pos               (7)
    #define CAN_SR_BS                   (0x01U << CAN_SR_BS_Pos)                ///< CAN bus status

////////////////////////////////////////////////////////////////////////////////
/// @brief CAN_ACR register Bit definition
////////////////////////////////////////////////////////////////////////////////
    #define CAN_ACR_AC                  (0xFFU << 0)                            ///< CAN acceptance code

////////////////////////////////////////////////////////////////////////////////
/// @brief CAN_AMR register Bit definition
////////////////////////////////////////////////////////////////////////////////
    #define CAN_AMR_AM_Pos              (0)
    #define CAN_AMR_AM                  (0xFFU << CAN_AMR_AM_Pos)               ///< CAN acceptance mask

////////////////////////////////////////////////////////////////////////////////
/// @brief CAN_BTR0 register Bit definition
////////////////////////////////////////////////////////////////////////////////
    #define CAN_BTR0_BRP_Pos            (0)
    #define CAN_BTR0_BRP                (0x003FU << CAN_BTR0_BRP_Pos)           ///< CAN baud rate prescaler
    #define CAN_BTR0_SJW_Pos            (6)
    #define CAN_BTR0_SJW                (0x03U << CAN_BTR0_SJW_Pos)             ///< CAN synchronization jump width

////////////////////////////////////////////////////////////////////////////////
/// @brief CAN_BTR1 register Bit definition
////////////////////////////////////////////////////////////////////////////////
    #define CAN_BTR1_TESG1_Pos          (0)
    #define CAN_BTR1_TESG1              (0x000FU << CAN_BTR1_TESG1_Pos)         ///< CAN Time segment 1
    #define CAN_BTR1_TESG2_Pos          (4)
    #define CAN_BTR1_TESG2              (0x07U << CAN_BTR1_TESG2_Pos)           ///< CAN Time segment 2
    #define CAN_BTR1_SAM_Pos            (7)
    #define CAN_BTR1_SAM                (0x01U << CAN_BTR1_SAM_Pos)             ///< CAN sampling

////////////////////////////////////////////////////////////////////////////////
/// @brief CAN_TXID0 register Bit definition
////////////////////////////////////////////////////////////////////////////////
    #define CAN_TXID0_ID_3_Pos          (0)
    #define CAN_TXID0_ID_3              (0x01U << CAN_TXID0_ID_3_Pos)           ///< CAN identifier byte 3
    #define CAN_TXID0_ID_4_Pos          (1)
    #define CAN_TXID0_ID_4              (0x01U << CAN_TXID0_ID_4_Pos)           ///< CAN identifier byte 4
    #define CAN_TXID0_ID_5_Pos          (2)
    #define CAN_TXID0_ID_5              (0x01U << CAN_TXID0_ID_5_Pos)           ///< CAN identifier byte 5
    #define CAN_TXID0_ID_6_Pos          (3)
    #define CAN_TXID0_ID_6              (0x01U << CAN_TXID0_ID_6_Pos)           ///< CAN identifier byte 6
    #define CAN_TXID0_ID_7_Pos          (4)
    #define CAN_TXID0_ID_7              (0x01U << CAN_TXID0_ID_7_Pos)           ///< CAN identifier byte 7
    #define CAN_TXID0_ID_8_Pos          (5)
    #define CAN_TXID0_ID_8              (0x01U << CAN_TXID0_ID_8_Pos)           ///< CAN identifier byte 8
    #define CAN_TXID0_ID_9_Pos          (6)
    #define CAN_TXID0_ID_9              (0x01U << CAN_TXID0_ID_9_Pos)           ///< CAN identifier byte 9
    #define CAN_TXID0_ID_10_Pos         (7)
    #define CAN_TXID0_ID_10             (0x01U << CAN_TXID0_ID_10_Pos)          ///< CAN identifier byte 10

////////////////////////////////////////////////////////////////////////////////
/// @brief CAN_TXID1 register Bit definition
////////////////////////////////////////////////////////////////////////////////
    #define CAN_TXID1_DLC0_Pos          (0)
    #define CAN_TXID1_DLC0              (0x01U << CAN_TXID1_DLC0_Pos)           ///< CAN data length code 0 ~ 8
    #define CAN_TXID1_DLC1_Pos          (1)
    #define CAN_TXID1_DLC1              (0x01U << CAN_TXID1_DLC1_Pos)           ///< CAN data length code 0 ~ 8
    #define CAN_TXID1_DLC2_Pos          (2)
    #define CAN_TXID1_DLC2              (0x01U << CAN_TXID1_DLC2_Pos)           ///< CAN data length code 0 ~ 8
    #define CAN_TXID1_DLC3_Pos          (3)
    #define CAN_TXID1_DLC3              (0x01U << CAN_TXID1_DLC3_Pos)           ///< CAN data length code 0 ~ 8
    #define CAN_TXID1_RTR_Pos           (4)
    #define CAN_TXID1_RTR               (0x01U << CAN_TXID1_RTR_Pos )           ///< CAN remote transmission request
    #define CAN_TXID1_ID_0_Pos          (5)
    #define CAN_TXID1_ID_0              (0x01U << CAN_TXID1_ID_0_Pos)           ///< CAN identifier byte 0
    #define CAN_TXID1_ID_1_Pos          (6)
    #define CAN_TXID1_ID_1              (0x01U << CAN_TXID1_ID_1_Pos)           ///< CAN identifier byte 1
    #define CAN_TXID1_ID_2_Pos          (7)
    #define CAN_TXID1_ID_2              (0x01U << CAN_TXID1_ID_2_Pos)           ///< CAN identifier byte 2

////////////////////////////////////////////////////////////////////////////////
/// @brief CAN_TXDRn register Bit definition
////////////////////////////////////////////////////////////////////////////////
    #define CAN_TXDRn                   (0x00FFU)                               // (n = 0..7)        ///< CAN send data

////////////////////////////////////////////////////////////////////////////////
/// @brief CAN_CDR register Bit definition
////////////////////////////////////////////////////////////////////////////////
    #define CAN_CDR_MODE_Pos            (7)
    #define CAN_CDR_MODE                (0x01U << CAN_CDR_MODE_Pos)             ///< CAN mode

////////////////////////////////////////////////////////////////////////////////
/// @brief CAN Peli
////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////
/// @brief CAN_MOD register Bit definition
////////////////////////////////////////////////////////////////////////////////
    #define CAN_MOD_RM_Pos              (0)
    #define CAN_MOD_RM                  (0x01U << CAN_MOD_RM_Pos)               ///< CAN reset mode
    #define CAN_MOD_LOM_Pos             (1)
    #define CAN_MOD_LOM                 (0x01U << CAN_MOD_LOM_Pos)              ///< CAN listen only mode
    #define CAN_MOD_STM_Pos             (2)
    #define CAN_MOD_STM                 (0x01U << CAN_MOD_STM_Pos)              ///< CAN self test mode
    #define CAN_MOD_AFM_Pos             (3)
    #define CAN_MOD_AFM                 (0x01U << CAN_MOD_AFM_Pos)              ///< CAN acceptance filter mode

////////////////////////////////////////////////////////////////////////////////
/// @brief CAN_CMR register Bit definition
////////////////////////////////////////////////////////////////////////////////
    #define CAN_CMR_TR_Pos              (0)
    #define CAN_CMR_TR                  (0x01U << CAN_CMR_TR_Pos )              ///< CAN transmission request
    #define CAN_CMR_AT_Pos              (1)
    #define CAN_CMR_AT                  (0x01U << CAN_CMR_AT_Pos )              ///< CAN abort transmission
    #define CAN_CMR_RRB_Pos             (2)
    #define CAN_CMR_RRB                 (0x01U << CAN_CMR_RRB_Pos)              ///< CAN release receive buffer
    #define CAN_CMR_CDO_Pos             (3)
    #define CAN_CMR_CDO                 (0x01U << CAN_CMR_CDO_Pos)              ///< CAN clear data overrun
    #define CAN_CMR_SRR_Pos             (4)
    #define CAN_CMR_SRR                 (0x01U << CAN_CMR_SRR_Pos)              ///< CAN self reset request

////////////////////////////////////////////////////////////////////////////////
/// @brief CAN_SR register Bit definition
////////////////////////////////////////////////////////////////////////////////
    #define CAN_SR_RBS_Pos              (0)
    #define CAN_SR_RBS                  (0x01U << CAN_SR_RBS_Pos)               ///< CAN receive buffer status
    #define CAN_SR_DOS_Pos              (1)
    #define CAN_SR_DOS                  (0x01U << CAN_SR_DOS_Pos)               ///< CAN data overrun status
    #define CAN_SR_TBS_Pos              (2)
    #define CAN_SR_TBS                  (0x01U << CAN_SR_TBS_Pos)               ///< CAN transmit buffer status
    #define CAN_SR_TCS_Pos              (3)
    #define CAN_SR_TCS                  (0x01U << CAN_SR_TCS_Pos)               ///< CAN transmission complete status
    #define CAN_SR_RS_Pos               (4)
    #define CAN_SR_RS                   (0x01U << CAN_SR_RS_Pos)                ///< CAN receive status
    #define CAN_SR_TS_Pos               (5)
    #define CAN_SR_TS                   (0x01U << CAN_SR_TS_Pos)                ///< CAN transmit status
    #define CAN_SR_ES_Pos               (6)
    #define CAN_SR_ES                   (0x01U << CAN_SR_ES_Pos)                ///< CAN error status
    #define CAN_SR_BS_Pos               (7)
    #define CAN_SR_BS                   (0x01U << CAN_SR_BS_Pos)                ///< CAN bus status

////////////////////////////////////////////////////////////////////////////////
/// @brief CAN_IR register Bit definition
////////////////////////////////////////////////////////////////////////////////
    #define CAN_IR_RI_Pos               (0)
    #define CAN_IR_RI                   (0x01U << CAN_IR_RI_Pos)                ///< CAN receive interrupt
    #define CAN_IR_TI_Pos               (1)
    #define CAN_IR_TI                   (0x01U << CAN_IR_TI_Pos)                ///< CAN transmit interrupt
    #define CAN_IR_EI_Pos               (2)
    #define CAN_IR_EI                   (0x01U << CAN_IR_EI_Pos)                ///< CAN error interrupt
    #define CAN_IR_DOI_Pos              (3)
    #define CAN_IR_DOI                  (0x01U << CAN_IR_DOI_Pos)               ///< CAN data overrun interrupt
    #define CAN_IR_EPI_Pos              (5)
    #define CAN_IR_EPI                  (0x01U << CAN_IR_EPI_Pos)               ///< CAN error passive interrupt
    #define CAN_IR_ALI_Pos              (6)
    #define CAN_IR_ALI                  (0x01U << CAN_IR_ALI_Pos)               ///< CAN arbitration lost interrupt
    #define CAN_IR_BEI_Pos              (7)
    #define CAN_IR_BEI                  (0x01U << CAN_IR_BEI_Pos)               ///< CAN bus error interrupt

