pengshulin/mcush/MindMotion/mm32f0/startup/inc/mm32.h
#define RCC_CIR_CSSF_Pos                (7)
#define RCC_CIR_CSSF                    (0x01U << RCC_CIR_CSSF_Pos)             ///< Clock Security System Interrupt flag
#define RCC_CIR_LSIRDYIE_Pos            (8)
#define RCC_CIR_LSIRDYIE                (0x01U << RCC_CIR_LSIRDYIE_Pos)         ///< LSI Ready Interrupt Enable

#if defined(__MM3N1)
    #define RCC_CIR_LSERDYIE_Pos        (9)
    #define RCC_CIR_LSERDYIE            (0x01U << RCC_CIR_LSERDYIE_Pos)         ///< LSE Ready Interrupt Enable
#endif

#define RCC_CIR_HSIRDYIE_Pos            (10)
#define RCC_CIR_HSIRDYIE                (0x01U << RCC_CIR_HSIRDYIE_Pos)         ///< HSI Ready Interrupt Enable
#define RCC_CIR_HSERDYIE_Pos            (11)
#define RCC_CIR_HSERDYIE                (0x01U << RCC_CIR_HSIRDYIE_Pos)         ///< HSE Ready Interrupt Enable

#if defined(__MM3N1) || defined(__MM0N1) || defined(__MM0P1)
    #define RCC_CIR_PLLRDYIE_Pos        (12)
    #define RCC_CIR_PLLRDYIE            (0x01U << RCC_CIR_PLLRDYIE_Pos)         ///< PLL Ready Interrupt Enable
#endif

#define RCC_CIR_LSIRDYC_Pos             (16)
#define RCC_CIR_LSIRDYC                 (0x01U << RCC_CIR_LSIRDYC_Pos)          ///< LSI Ready Interrupt Clear

#if defined(__MM3N1)
    #define RCC_CIR_LSERDYC_Pos         (17)
    #define RCC_CIR_LSERDYC             (0x01U << RCC_CIR_LSERDYC_Pos)          ///< LSE Ready Interrupt Clear
#endif

#define RCC_CIR_HSIRDYC_Pos             (18)
#define RCC_CIR_HSIRDYC                 (0x01U << RCC_CIR_HSIRDYC_Pos)          ///< HSI Ready Interrupt Clear
#define RCC_CIR_HSERDYC_Pos             (19)
#define RCC_CIR_HSERDYC                 (0x01U << RCC_CIR_HSERDYC_Pos)          ///< HSE Ready Interrupt Clear

#if defined(__MM3N1) || defined(__MM0N1) || defined(__MM0P1)
    #define RCC_CIR_PLLRDYC_Pos         (20)
    #define RCC_CIR_PLLRDYC             (0x01U << RCC_CIR_PLLRDYC_Pos)          ///< PLL Ready Interrupt Clear
#endif

#define RCC_CIR_CSSC_Pos                (23)
#define RCC_CIR_CSSC                    (0x01U << RCC_CIR_CSSC_Pos)             ///< Clock Security System Interrupt Clear

////////////////////////////////////////////////////////////////////////////////
/// @brief RCC_APB2RSTR Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
    #define RCC_APB2RSTR_EXTI_Pos       (0)
    #define RCC_APB2RSTR_EXTI           (0x01U << RCC_APB2RSTR_EXTI_Pos)        ///< System Configuration register reset

#if defined(__MM3N1)
    #define RCC_APB2RSTR_GPIOA_Pos      (2)
    #define RCC_APB2RSTR_GPIOA          (0x01U << RCC_APB2RSTR_GPIOA_Pos)       ///< I/O port A reset
    #define RCC_APB2RSTR_GPIOB_Pos      (3)
    #define RCC_APB2RSTR_GPIOB          (0x01U << RCC_APB2RSTR_GPIOB_Pos)       ///< IO port B reset
    #define RCC_APB2RSTR_GPIOC_Pos      (4)
    #define RCC_APB2RSTR_GPIOC          (0x01U << RCC_APB2RSTR_GPIOC_Pos)       ///< IO port C reset
    #define RCC_APB2RSTR_GPIOD_Pos      (5)
    #define RCC_APB2RSTR_GPIOD          (0x01U << RCC_APB2RSTR_GPIOD_Pos)       ///< IO port D reset
    #define RCC_APB2RSTR_GPIOE_Pos      (6)
    #define RCC_APB2RSTR_GPIOE          (0x01U << RCC_APB2RSTR_GPIOE_Pos)       ///< IO port E reset
#endif

#if defined(__MM3N1) || defined(__MM0P1)
    #define RCC_APB2RSTR_ADC1_Pos       (9)
    #define RCC_APB2RSTR_ADC1           (0x01U << RCC_APB2RSTR_ADC1_Pos)        ///< ADC 1 interface reset
    #define RCC_APB2RSTR_ADC2_Pos       (10)
    #define RCC_APB2RSTR_ADC2           (0x01U << RCC_APB2RSTR_ADC2_Pos)        ///< ADC 2 interface reset
#endif

#if defined(__MM0N1) || defined(__MM0Q1)
    #define RCC_APB2RSTR_ADC1_Pos       (9)
    #define RCC_APB2RSTR_ADC1           (0x01U << RCC_APB2RSTR_ADC1_Pos)        ///< ADC interface reset
#endif

#if defined(__MM0P1)
    #define RCC_APB2RSTR_TIM8_Pos       (13)
    #define RCC_APB2RSTR_TIM8           (0x01U << RCC_APB2RSTR_TIM8_Pos)        ///< TIM8 Timer reset
#endif

#define RCC_APB2RSTR_TIM1_Pos           (11)
#define RCC_APB2RSTR_TIM1               (0x01U << RCC_APB2RSTR_TIM1_Pos)        ///< TIM1 Timer reset
#define RCC_APB2RSTR_SPI1_Pos           (12)
#define RCC_APB2RSTR_SPI1               (0x01U << RCC_APB2RSTR_SPI1_Pos)        ///< SPI 1 reset
#define RCC_APB2RSTR_UART1_Pos          (14)
#define RCC_APB2RSTR_UART1              (0x01U << RCC_APB2RSTR_UART1_Pos)       ///< UART1 reset
#define RCC_APB2RSTR_COMP_Pos           (15)
#define RCC_APB2RSTR_COMP               (0x01U << RCC_APB2RSTR_COMP_Pos)        ///< COMP interface reset

#if defined(__MM0N1) || defined(__MM0P1) || defined(__MM0Q1)
    #define RCC_APB2RSTR_TIM14_Pos      (16)
    #define RCC_APB2RSTR_TIM14          (0x01U << RCC_APB2RSTR_TIM14_Pos)       ///< TIM14 Timer reset
    #define RCC_APB2RSTR_TIM16_Pos      (17)
    #define RCC_APB2RSTR_TIM16          (0x01U << RCC_APB2RSTR_TIM16_Pos)       ///< TIM16 Timer reset
    #define RCC_APB2RSTR_TIM17_Pos      (18)
    #define RCC_APB2RSTR_TIM17          (0x01U << RCC_APB2RSTR_TIM17_Pos)       ///< TIM17 Timer reset
    #define RCC_APB2RSTR_DBGMCU_Pos     (22)
    #define RCC_APB2RSTR_DBGMCU         (0x01U << RCC_APB2RSTR_DBGMCU_Pos)      ///< DBGMCU reset
#endif

#if defined(__MM0P1) || defined(__MM0Q1)
    #define RCC_APB2RSTR_PWM_Pos        (23)
    #define RCC_APB2RSTR_PWM            (0x01U << RCC_APB2RSTR_PWM_Pos)         ///< PWM reset
#endif

////////////////////////////////////////////////////////////////////////////////
/// @brief RCC_APB1RSTR Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define RCC_APB1RSTR_TIM2_Pos           (0)
#define RCC_APB1RSTR_TIM2               (0x01U << RCC_APB1RSTR_TIM2_Pos)        ///< Timer 2 reset
#define RCC_APB1RSTR_TIM3_Pos           (1)
#define RCC_APB1RSTR_TIM3               (0x01U << RCC_APB1RSTR_TIM3_Pos)        ///< Timer 3 reset

#if defined(__MM3N1)
    #define RCC_APB1RSTR_TIM4_Pos       (2)
    #define RCC_APB1RSTR_TIM4           (0x01U << RCC_APB1RSTR_TIM4_Pos)        ///< Timer 4 reset
#endif

